////////////////////////////////////////////////////////////////
// ByteMachine
// Базовый класс исключения
////////////////////////////////////////////////////////////////
#ifndef BASE_EXCEPTION_H
#define BASE_EXCEPTION_H

//==============================================================
#include <QString>

//==============================================================
// Базовый класс исключения
//==============================================================
class BaseException
{
public:
    // Конструктор по умолчанию
    BaseException() = default;
    // Конструктор с параметром
    BaseException(const QString &msg);

    // Получение сообщения
    QString msg() const { return msg_; }
private:
    // Сообщение
    QString msg_{};
};

//==============================================================
#endif // BASE_EXCEPTION_H
