////////////////////////////////////////////////////////////////
// ByteMachine
// Интерфейс для работы с данными
////////////////////////////////////////////////////////////////
#ifndef I_DATA_H
#define I_DATA_H

//==============================================================
#include <QVector>
#include <cstdint>

//==============================================================
// Интерфейс для работы с данными
//==============================================================
struct IData
{
    // Деструктор
    virtual ~IData() = default;

    // Получение размера данных
    [[nodiscard]]
    virtual int32_t dataSize() const = 0;
    // Получение байта данных
    [[nodiscard]]
    virtual uint8_t dataByte(int32_t index) const = 0;
    // Получение блока данных
    [[nodiscard]]
    virtual QVector<uint8_t> dataBlock(int32_t index, int32_t count) const = 0;
    // Функция вызывается при изменении данных
    virtual void dataChanged() = 0;
};

//==============================================================
#endif // I_DATA_H
