////////////////////////////////////////////////////////////////
// ByteMachine
// Интерфейс для работы с данными
////////////////////////////////////////////////////////////////
#ifndef I_DATA_H
#define I_DATA_H

//==============================================================
#include <QVector>

//==============================================================
// Интерфейс для работы с данными
//==============================================================
struct IData
{
    // Деструктор
    virtual ~IData() = default;

    // Получение размера данных
    [[nodiscard]]
    virtual qint32 dataSize() const = 0;
    // Получение байта данных
    [[nodiscard]]
    virtual quint8 dataByte(qint32 index) const = 0;
    // Получение блока данных
    [[nodiscard]]
    virtual QVector<quint8> dataBlock(qint32 index, qint32 count) const = 0;
    // Функция вызывается при изменении данных
    virtual void dataChanged() = 0;
};

//==============================================================
#endif // I_DATA_H
