////////////////////////////////////////////////////////////////
// ByteMachine
// Интерфейс представления объекта в виде строки
////////////////////////////////////////////////////////////////
#ifndef I_TO_STR_H
#define I_TO_STR_H

//==============================================================
#include <QString>

//==============================================================
// Интерфейс представления объекта в виде строки
//==============================================================
struct IToStr
{
    // Деструктор
    virtual ~IToStr() = default;

    // Получение представления в виде строки
    [[nodiscard]]
    virtual QString toStr() const = 0;
};

//==============================================================
#endif // I_TO_STR_H
