////////////////////////////////////////////////////////////////
// ByteMachine
// Иконки
////////////////////////////////////////////////////////////////
#include "icons.h"

//==============================================================
// Получение иконки New
//==============================================================
QIcon Icons::new_()
{
    return QIcon{":/res_images/images/new.png"};
}

//==============================================================
// Получение иконки Open
//==============================================================
QIcon Icons::open()
{
    return QIcon{":/res_images/images/open.png"};
}

//==============================================================
// Получение иконки Add
//==============================================================
QIcon Icons::add()
{
    return QIcon{":/res_images/images/add.png"};
}

//==============================================================
// Получение иконки Save
//==============================================================
QIcon Icons::save()
{
    return QIcon{":/res_images/images/save.png"};
}

//==============================================================
// Получение иконки Undo
//==============================================================
QIcon Icons::undo()
{
    return QIcon{":/res_images/images/undo.png"};
}

//==============================================================
// Получение иконки Redo
//==============================================================
QIcon Icons::redo()
{
    return QIcon{":/res_images/images/redo.png"};
}

//==============================================================
// Получение иконки Cut
//==============================================================
QIcon Icons::cut()
{
    return QIcon{":/res_images/images/cut.png"};
}

//==============================================================
// Получение иконки Copy
//==============================================================
QIcon Icons::copy()
{
    return QIcon{":/res_images/images/copy.png"};
}

//==============================================================
// Получение иконки Paste
//==============================================================
QIcon Icons::paste()
{
    return QIcon{":/res_images/images/paste.png"};
}

//==============================================================
// Получение иконки ResetValue
//==============================================================
QIcon Icons::resetValue()
{
    return QIcon{":/res_images/images/reset_value.png"};
}

//==============================================================
// Получение иконки Delete
//==============================================================
QIcon Icons::delete_()
{
    return QIcon{":/res_images/images/delete.png"};
}

//==============================================================
// Получение иконки PaintMode
//==============================================================
QIcon Icons::paintMode()
{
    return QIcon{":/res_images/images/paint_mode.png"};
}

//==============================================================
// Получение иконки VisibleNodeComments
//==============================================================
QIcon Icons::visibleNodeComments()
{
    return QIcon{":/res_images/images/visible_node_comments.png"};
}

//==============================================================
// Получение иконки VisibleNodesPanel
//==============================================================
QIcon Icons::visibleNodesPanel()
{
    return QIcon{":/res_images/images/visible_node_panel.png"};
}

//==============================================================
// Получение иконки VisibleSettingPanel
//==============================================================
QIcon Icons::visibleSettingsPanel()
{
    return QIcon{":/res_images/images/visible_settings_panel.png"};
}

//==============================================================
// Получение иконки VisibleDesignerGrid
//==============================================================
QIcon Icons::visibleDesignerGrid()
{
    return QIcon{":/res_images/images/visible_designer_grid.png"};
}

//==============================================================
// Получение иконки Help
//==============================================================
QIcon Icons::help()
{
    return QIcon{":/res_images/images/help.png"};
}

//==============================================================
// Получение иконки CollapseArrow
//==============================================================
QIcon Icons::collapseArrow()
{
    return QIcon{":/res_images/images/collapse_arrow.png"};
}

//==============================================================
// Получение иконки ExpandArrow
//==============================================================
QIcon Icons::expandArrow()
{
    return QIcon{":/res_images/images/expand_arrow.png"};
}

//==============================================================
// Получение иконки StandartNode
//==============================================================
QIcon Icons::standartNode()
{
    return QIcon{":/res_images/images/standart_node.png"};
}

//==============================================================
// Получение иконки StandartNode в режиме Disable
//==============================================================
QIcon Icons::standartNodeDisable()
{
    return QIcon{":/res_images/images/standart_node_disable.png"};
}
