////////////////////////////////////////////////////////////////
// ByteMachine
// Дополнительные математические функции
////////////////////////////////////////////////////////////////
#ifndef MATH_HELPER_H
#define MATH_HELPER_H

//==============================================================
#include <QPointF>

//==============================================================
// Прототипы функций
//==============================================================
// Расчёт угла по двум точкам QPointF
[[nodiscard]]
double calcAngle(const QPointF &beginPt, const QPointF &endPt);

//==============================================================
#endif // MATH_HELPER_H
