////////////////////////////////////////////////////////////////
// ByteMachine
// Типы узлов
////////////////////////////////////////////////////////////////
#ifndef NODE_TYPES_H
#define NODE_TYPES_H

//==============================================================
#include <QString>
#include <QVector>
#include <QMetaType>

//==============================================================
// Типы узлов
//==============================================================
enum class NodeTypes
{
    Unknown = -1,
    Generate,
    InFile,
    Take,
    Skip,
    Reverse,
    Merge,
    Struct,
    Dump,
    Paint,
    Size,
    OutFile,
    Non,
    SIn,
    SChange,
    SMerge,
    SOut,
    Count
};

//==============================================================
Q_DECLARE_METATYPE(NodeTypes);

//==============================================================
// Прототипы функций
//==============================================================

//==============================================================
#endif // NODE_TYPES_H
