////////////////////////////////////////////////////////////////
// ByteMachine
// Типы узлов
////////////////////////////////////////////////////////////////
#ifndef NODE_TYPES_H
#define NODE_TYPES_H

//==============================================================
#include <QString>
#include <QMetaType>

//==============================================================
// Типы узлов
//==============================================================
enum class NodeTypes
{
    Unknown = -1,
    Generate,
    InFile,
    Take,
    Skip,
    Reverse,
    Merge,
    OutFile,
    PaintOp,
    Size,
    Dump,
    Struct,
    Graph,
    SIn,
    SChange,
    SMerge,
    SOut,
    Block,
    Non,
    Count
};

//==============================================================
Q_DECLARE_METATYPE(NodeTypes);

//==============================================================
// Прототипы функций
//==============================================================
// Конвертация типа узла в строку
QString nodeTypeToStr(NodeTypes type);
// Конвертация строки в тип узла
NodeTypes strToNodeType(const QString &str);

//==============================================================
#endif // NODE_TYPES_H
