////////////////////////////////////////////////////////////////
// ByteMachine
// Класс проекта
////////////////////////////////////////////////////////////////
#ifndef PROJECT_H
#define PROJECT_H

//==============================================================
#include <QObject>

//==============================================================
// Класс проекта
//==============================================================
class Project : public QObject
{
    Q_OBJECT
    Q_DISABLE_COPY_MOVE(Project)
public:
    // Получение экземпляра
    static Project* instance();
private:
    // Конструктор с параметром
    explicit Project(QObject *parent = nullptr);

    // Задание соединений
    void setConnections();
};

//==============================================================
// Прототипы функций
//==============================================================
// Получение проекта
Project* project();

//==============================================================
#endif // PROJECT_H
