////////////////////////////////////////////////////////////////
// ByteMachine
// Вспомогательные функции Qt
////////////////////////////////////////////////////////////////
#ifndef QT_HELPER_H
#define QT_HELPER_H

//==============================================================
#include <QString>

//==============================================================
// Прототипы функций
//==============================================================
// Сделать заглавную букву строки строчной
[[nodiscard]]
QString capitalizeStr(const QString &str);

//==============================================================
#endif // QT_HELPER_H
