////////////////////////////////////////////////////////////////
// ByteMachine
// Вспомогательные функции Qt
////////////////////////////////////////////////////////////////
#include "qt_helper.h"

//==============================================================
// Сделать заглавную букву строки строчной
//==============================================================
QString capitalizeStr(const QString &str)
{
    if (!str.isEmpty())
    {
        return str.front().toLower() + str.mid(1);
    }
    else
    {
        return str;
    }
}
