////////////////////////////////////////////////////////////////
// ByteMachine
// Вывод состояния узла в виджет
////////////////////////////////////////////////////////////////
#ifndef SHOW_NODE_STATE_H
#define SHOW_NODE_STATE_H

//==============================================================
#include "node_state_info.h"

//==============================================================
class BaseNode;
class QPlainTextEdit;

//==============================================================
// Прототипы функций
//==============================================================
// Вывод состояния узла в виджет
void showNodeState(const BaseNode *node, QPlainTextEdit *textEdit);
// Вывод состояния узла в виджет
void showNodeState(NodeStateInfo stateInfo, QPlainTextEdit *textEdit);

//==============================================================
#endif // SHOW_NODE_STATE_H
