////////////////////////////////////////////////////////////////
// ByteMachine
// Функция отмены удаления узла
////////////////////////////////////////////////////////////////
#ifndef UNDO_REMOVE_NODE_H
#define UNDO_REMOVE_NODE_H

//==============================================================
#include <QUndoCommand>

//==============================================================
class Project;

//==============================================================
// Функция отмены удаления узла
//==============================================================
class UndoRemoveNode : public QUndoCommand
{
public:
    // Конструктор с параметрами
    // Деструктор
    ~UndoRemoveNode();

    // Функция отмены
    void undo() override;
    // Функция восстановления
    void redo() override;
private:
    // Проект
    Project *project_{nullptr};
};

//==============================================================
#endif // UNDO_REMOVE_NODE_H
