////////////////////////////////////////////////////////////////
// ByteMachine
// Панель со списком отмен
////////////////////////////////////////////////////////////////
#ifndef WIDGET_UNDO_VIEW_H
#define WIDGET_UNDO_VIEW_H

//==============================================================
#include <QWidget>

//==============================================================
class QUndoStack;

//==============================================================
// Панель со списком отмен
//==============================================================
class WidgetUndoView : public QWidget
{
    Q_OBJECT
public:
    // Конструктор с параметрами
    explicit WidgetUndoView(QUndoStack *undoStack, QWidget *parent = nullptr);
    // Деструктор
    ~WidgetUndoView() override;
};

//==============================================================
#endif // WIDGET_UNDO_VIEW_H
