////////////////////////////////////////////////////////////////
// ByteMachine
// Перемещаемый узел
////////////////////////////////////////////////////////////////
#ifndef MOVING_NODE_H
#define MOVING_NODE_H

//==============================================================
#include "base_node.h"

//==============================================================
// Перемещаемый узел
//==============================================================
struct MovingNode
{
    // Функция инициализации
    void init(const ShPtrBaseNode &node, const QPoint &grabOffset);
    // Получение признак перемещения
    bool isMove() const
    {
        return node != nullptr;
    }
    // Сброс
    void reset();

    // Узел
    ShPtrBaseNode node{};
    // Смещение захвата
    QPoint grabOffset{};
};

//==============================================================
#endif // MOVING_NODE_H
