////////////////////////////////////////////////////////////////
// ByteMachine
// Перемещаемый узел
////////////////////////////////////////////////////////////////
#include "moving_node.h"

//==============================================================
// Функция инициализации
//==============================================================
void MovingNode::init(const ShPtrBaseNode &node, const QPoint &grabOffset)
{
    Q_ASSERT(node != nullptr);

    this->node = node;
    this->grabOffset = grabOffset;
}

//==============================================================
// Сброс
//==============================================================
void MovingNode::reset()
{
    node = nullptr;
    grabOffset = QPoint{};
}
