////////////////////////////////////////////////////////////////
// ByteMachine
// Описание значения свойства
////////////////////////////////////////////////////////////////
#include "prop_value.h"

//==============================================================
// Конструктор с параметрами
//==============================================================
PropValue::PropValue(const QString &name, const QVariant &value)
{
    Q_ASSERT(!name.isEmpty());

    this->name = name;
    this->value = value;
}
