////////////////////////////////////////////////////////////////
// ByteMachine
// Панель со списком отмен
////////////////////////////////////////////////////////////////
#ifndef FORM_UNDO_VIEW_H
#define FORM_UNDO_VIEW_H

//==============================================================
#include <QWidget>

//==============================================================
class QUndoStack;

//==============================================================
// Панель со списком отмен
//==============================================================
class FormUndoView : public QWidget
{
    Q_OBJECT
public:
    // Конструктор с параметрами
    explicit FormUndoView(QUndoStack *undoStack, QWidget *parent = nullptr);
    // Деструктор
    ~FormUndoView() override;
};

//==============================================================
#endif // FORM_UNDO_VIEW_H
